{
	"aboutMe": "About Me",
	"aboutMePara1": "Hi, my name is Nikhil Verma. I am a Computer Science major at Rochester Institute of technology. I love building stuff from scratch. I made this website to share my creations (and other ramblings) with the rest of the world. My interests is in Computer graphics and animation.",
	"aboutMePara2": "Through this website, I hope to share my insight and development experiences with the rest of the world. ",
	"downloadResume":"Download Resume",
	"skillsNTechnologies": "Skills and Technologies",
	"projects": "Projects",
	"titleProject1": "Carry the Flame",
	"briefProject1": "Spread fire, burn stuff, Carry the flame",
	"detailProject1": "This is a simulaiton game for iPads. The concept revolves around spreading fire across a variety of inflamable objects on a table until it reaches a target egg. The development necessitated me to create a physics simulated gameplay system,several artwork resources,sound, music, and a (pretty detailed) XML based level editor right inside the app.Took me 2 years to finish this project till completion.",
	"titleProject2": "Timeshift",
	"briefProject2": "A keyframe based animation editor",
	"detailProject2": "Animation has always intrigued me. Timeshift is a loosely coupled 2D animation engine with a very capable editor. The editor allows keyframing several properties of a shape (such as scale,rotation and translation) to create interpolated animations. The interface has a workspace with several tools, a keyframe table containing list of shapes in the workspace, fully functional selection system,a graph editor,shape specific gizmos,motion paths and multi level undo-redo on every operation. The project is apparently still incomplete but I learned alot about design patterns during the 6 months of dense development.",
	"titleProject3": "Spot Search",
	"briefProject3": "A nifty search tool for music",
	"detailProject3": "This application provides music results for a search query and beautifully displays them to the user. It hits the spotify web API to get the results and categorizes them across three tabs : Tracks, Albums and Artists. Clicking on any result will take the user straight to the Spotify Web Player for that song.",
	"titleProject4": "Snakes Ergo",
	"briefProject4": "Remember snakes? Well this one has a twist",
	"detailProject4": "The twist is that the control mechanic is this ergonomic widget that I designed. Before the smartphone era, this game was a blast on physical keyboard, I wanted to bring back that same experience on touch screen devices. This game also includes several themes to choose from and your choice of grid size. ",
	"titleProject5": "Sudoku all Solver",
	"briefProject5": "Not just any solver, an \"All Solver\"",
	"detailProject5": "The \"All Solver\" part means that its capable of solving every iteration of a sudoku problem. This means that for an incomplete problem (one which doesn't have a unique solution), it will give every possible solution to that problem even if there are like a billion. These solutions can be traversed back and forth. I call it the 'Number Map' algorithm. I designed it myself.",
	"titleProject6": "Laying Bricks",
	"briefProject6": "Tetrix clone (I admit). But its pretty neat",
	"detailProject6": "Not much to say except that its fun to play. The controls are simple and sound effects are nice. Okay I will stop bragging now.",
	"contactMe": "Contact Me",
	"name": "Name",
	"email": "Email",
	"message": "Message",
	"send": "Send",
	"contactSuccess":"Thanks, I will get in touch with you soon!",
	"contactFailure":"UH OH! Something went wrong. Please try again soon.",
	"title1CarryTheFlame": "Help Drogo",
	"detail1CarryTheFlame": "Young drogo is having a tough time coming out of his shell. His mother is not around and the egg won't incubate on its own. Fortunately there are enough inflamable items lying across the board. Can you help drogo hatch out of his egg?",
	"title2CarryTheFlame": "Spread Fire",
	"detail2CarryTheFlame": "Your job is to spread fire till it reaches the egg. Use Matchsticks, Rockets,  Gunpowder and several other household items littered on the table to create a chain reaction that carries the flame straight to drogo's shell.",
	"title3CarryTheFlame": "Mind your Surroundings",
	"detail3CarryTheFlame": "Remember, you gotta keep the flame alive. This means, water, ice and wind are your worst enemies. If you run out of fire, you lose. ",
	"title1Sudoku": "Solves Any..Solves All",
	"detail1Sudoku": "Don't bother putting all the numbers in. Our \"Number Map\" algorithm is intelligent enough to give instant solution to any problem, including partially filled ones. You can navigate back and forth between the different solutions.",
	"title2Sudoku": "Easy.Medium.Hard",
	"detail2Sudoku": "Having a robust solver is great. Having a randomly generated puzzle section is better. Just choose your difficultly setting and off you go. There is a handy hint feature too, for a more casual experience.",
	"title3Sudoku": "Unlimited.Overloaded",
	"detail3Sudoku": "Sudokus are crazy. There a are like a gazillion possible combinations that fit the grid. You can randomly generate each one these (because why not). There is a pause button too, in case you fall in love with one.",
	"pageTitleSnakes": "Snakes Ergo",
	"title1Snakes": "Classic.Simple.Mobile",
	"detail1Snakes": "We introduced a new control system for touchscreen devices. Its basicallya a cross shaped widget that can be moved anywhere across the screen. You tap on the four sections of the cross to control the snake.",
	"title2Snakes": "Grid Size.Customizable",
	"detail2Snakes": "No one likes running out of grid space for their snake. No one likes loosing early either .Choose a small grid if you are new. Once you get better, move to a larger grid.",
	"title3Snakes": "Themes.Many",
	"detail3Snakes": "Old doesn't mean ugly. This app packs a variety of themes to choose from. The classic gray theme is also included.",
	"carryTheFlame": "Carry the Flame",
	"sudokuAllSolver": "Sudoku All Solver",
	"snakesErgo": "Snakes Ergo",
	"layingBricks": "Laying Bricks",
	"timeshift": "Timeshift",
	"graphIt": "Graph It",
	"spotSearch": "Spot Search",
	"home": "Home",
	"blog": "Blog",
	"apps": "Apps",
	"pageTitleSudoku": "Sudoku all Solver",
	"pageTitleCarryTheFlame": "Carry the Flame",
	"more": "More",
	"about": "About",
	"contact": "Contact",
	"pageTitle": "Made By Nikhil"
}