{
	"defaultHtmlTitle":"MadeByNikhil",
	"aboutMe": "About Me",
	"aboutMePara1": "Hi, I am Nikhil Verma, creator of ",
	"fileNeat":"File Neat",
	"and":" and ",
	"aboutMePara1AfterLinks":". As a full stack developer, I love working on crazy ideas that delight the user. Currently, I am pursuing my masters degree in computer science from Rochester Institute of Technology. I have worked on several side projects and apps. I made this website to share some of my development experiences and insights. My interests is in computer graphics, simulation and user experience.",
	"aboutMePara2": "Through this website, I hope to share my insight and development experiences with the rest of the community. ",
	"downloadResume": "Download Resume",
	"skillsNTechnologies": "Skills and Technologies",
	"projects": "Projects",
	"titleProject1": "Carry the Flame",
	"briefProject1": "Spread fire, burn stuff, Carry the flame",
	"detailProject1": "A unique simulation based puzzle game for iPad. Spread fire across a variety of inflammable items until it reaches its target. The development involved a physics simulated gameplay mechanic, several artwork resources, sound, music, and a (pretty detailed) XML based level editor right inside the app.",
	"titleProject2": "Timeshift",
	"briefProject2": "A keyframe based animation editor",
	"detailProject2": "An animation tool that allows tweaking and keyframing several properties of shapes on a timeline. With support for undoable operations, the editor comprises of a canvas with several tools, a keyframe table containing list of shapes in the workspace, fully functional selection system,a graph editor,shape specific gizmos.",
	"titleProject3": "Spot Search",
	"briefProject3": "A nifty search tool for music",
	"detailProject3": "This application provides music results for a search query and beautifully displays them to the user. It hits the spotify web API to get the results and categorizes them across three tabs : Tracks, Albums and Artists. Clicking on any result will take the user straight to the Spotify Web Player for that song.",
	"titleProject4": "Snakes Ergo",
	"briefProject4": "Snakes game for smartphones devices",
	"detailProject4": "Features a custom joystick control for improved ergonomics.The game also includes several themes and grid sizes. ",
	"titleProject5": "Sudoku all Solver",
	"briefProject5": "iPhone app that instantly solves any sudoku problem",
	"detailProject5": "Designed an algorithm capable of finding multiple solutions of a sudoku problem. For an incomplete problem (i.e one without a unique solution), it will give every possible combination that covers the puzzle. ",
	"titleProject6": "Laying Bricks",
	"briefProject6": "A pretty neat Tetris clone",
	"detailProject6": "Fun to play on a smartphone device. The controls are simple and sound effects are nice.",
	"titleFine": "File Neat",
	"briefFine": "Disk usage + File organization tool",
	"detailFine": "File Neat is an HTML5 based disk utility application that scans through a users file system and shows them their disk usage in a beautiful sunburst chart. It also has a file browser which allows carrying out bulk file operations without needing to rescan the file system.",
	"titleOpengl": "OpenGL Scene",
	"briefOpengl": "3D Scene created using OpenGL",
	"detailOpengl": "As part of the final project for the Computer Graphics course, this 3 day project involved creating a 3D scene in OpenGL with shaders used for lightening and texture calculations.",
	"titleCalc": "Calculator",
	"briefCalc": "A versatile calculator",
	"detailCalc": "Developed in JavaFX, the calculator supports evaluation of complex mathematical expressions involving brackets and boolean operations",
	"titleRecycleRampage":"Recycle Rampage",
	"briefRecycleRampage":"A recycling game developed in a Unity",
	"detailRecycleRampage":"This was done at a 36 hour hackathon held at Cornell University. Our team comprised of an artist and 2 developers. I developed the main gameplay mechanic while my partner wrote code for handling the UI. We ended up winning the best UI/UX prize category.",
	"contactMe": "Contact Me",
	"name": "Name",
	"message": "Message",
	"send": "Send",
	"contactSuccess": "Thanks, I will get in touch with you soon!",
	"contactFailure": "UH OH! Something went wrong. Please try again soon.",
	"title1CarryTheFlame": "Help Drogo",
	"detail1CarryTheFlame": "Young drogo is having a tough time coming out of his shell. His mother is not around and the egg won't incubate on its own. Fortunately there are enough inflamable items lying across the board. Can you help drogo hatch out of his egg?",
	"title2CarryTheFlame": "Spread Fire",
	"detail2CarryTheFlame": "Your job is to spread fire till it reaches the egg. Use Matchsticks, Rockets,  Gunpowder and several other household items littered on the table to create a chain reaction that carries the flame straight to drogo's shell.",
	"title3CarryTheFlame": "Mind your Surroundings",
	"detail3CarryTheFlame": "Remember, you gotta keep the flame alive. This means, water, ice and wind are your worst enemies. If you run out of fire, you lose. ",
	"title1Sudoku": "Solves Any..Solves All",
	"detail1Sudoku": "Don't bother putting all the numbers in. Our \"Number Map\" algorithm is intelligent enough to give instant solution to any problem, including partially filled ones. You can navigate back and forth between the different solutions.",
	"title2Sudoku": "Easy.Medium.Hard",
	"detail2Sudoku": "Having a robust solver is great. Having a randomly generated puzzle section is better. Just choose your difficultly setting and off you go. There is a handy hint feature too, for a more casual experience.",
	"title3Sudoku": "Unlimited.Overloaded",
	"detail3Sudoku": "Sudokus are crazy. There a are like a gazillion possible combinations that fit the grid. You can randomly generate each one these (because why not). There is a pause button too, in case you fall in love with one.",
	"pageTitleSnakes": "Snakes Ergo",
	"title1Snakes": "Classic.Simple.Mobile",
	"detail1Snakes": "We introduced a new control system for touchscreen devices. Its basicallya a cross shaped widget that can be moved anywhere across the screen. You tap on the four sections of the cross to control the snake.",
	"title2Snakes": "Grid Size.Customizable",
	"detail2Snakes": "No one likes running out of grid space for their snake. No one likes loosing early either .Choose a small grid if you are new. Once you get better, move to a larger grid.",
	"title3Snakes": "Themes.Many",
	"detail3Snakes": "Old doesn't mean ugly. This app packs a variety of themes to choose from. The classic gray theme is also included.",
	"carryTheFlame": "Carry the Flame",
	"sudokuAllSolver": "Sudoku All Solver",
	"snakesErgo": "Snakes Ergo",
	"layingBricks": "Laying Bricks",
	"timeshift": "Timeshift",
	"graphIt": "Graph It",
	"spotSearch": "Spot Search",
	"home": "Home",
	"blog": "Blog",
	"apps": "Apps",
	"pageTitleSudoku": "Sudoku all Solver",
	"pageTitleCarryTheFlame": "Carry the Flame",
	"more": "More",
	"about": "About",
	"contact": "Contact Me",
	"pageTitle": "Nikhil Verma",
	"portfolio": "Portfolio",
	"education": "Education",
	"educationDetail": "Completed Bachelors in Computer Science. Currently pursuing Masters in Computer Science from Rochester Institute of Technology.",
	"workEx": "Work Experience",
	"workExDetail": "Worked previously as a Java web developer for 2 years. Several live side projects.",
	"email": "Email",
	"emailValue": "nikhilnxvverma1@gmail.com",
	"mobile": "Mobile",
	"mobileValue": "585-309-2778",
	"viewPortfolio": "View Portfolio",
	"viewFullResume": "View Full Resume",
	"Email": "Email",
  "madeBy":"madeby",
  "nikhil":"nikhil"
}
